# ----- 信息 -----
# @filename CoreLang.sh
# @version 1.0
# @author qye.zheng
# @description 语言核心

#!/bin/sh


###################### shell 变量  ######################
# 1) Shell Script 是一种弱类型语言，使用变量时无需先声明其类型
# 2) 一个文件中声明的变量属于本地变量，为当前的shell所有，任何子进程都不能访问本地变量
# 3) 环境变量: 环境变量存储在 用户环境区，属于公共区域，可以被子进程访问
# 4) 变量赋值: variableName=value   (赋值的等号两边不能有空格)
# 5) 使用变量: $variableName，可以在双引号中使用，若出现混淆，可以加上大括号来区分 --> ${variableName} "${variableName}"
#	注意: 单引号中的${variableName} 不会进行替换，
# 6) env 用于显示 用户环境区 的变量和值，set 用于显示本地数据区和用户环境区的变量和值；
#	unset 用户删除指定变量的当前值，该值将被指定为null；export 用于将本地数据区的变量转移到用户环境区
#


# 1) exit 0  --> 退出当前进程
# 2) shift  -> 删除参数列表 $1 参数
#

#
#
#

###################### 变量名称  ######################
# 1) $# : 包括$0在内的参数个数
# 2) $0 : 脚本名称
# 3) $1 $2 $3 ...${10} ${11}
# 4) $* : 表示整个参数列表，但不包括 $0
# 5) $? : 表示上次脚本的退出码；0-执行成功，非0执行失败 (即 最后一条命令的返回值)
# 6) $$ : 子进程的 PID
# 7) $! :  上一次进程的 PID
# 8) $@ : 保存所有的参数

#
#
#

#
#
#

######################  ######################
#
#
#

#
#
#

#
#
#

######################  ######################
#
#
#

#
#
#

#
#
#
######################  ######################
#
#
#

#
#
#

#
#
#

######################  ######################


######################  ######################


######################  ######################

######################  ######################


######################  ######################


######################  ######################


######################  ######################









