# ----- 信息 -----
# @filename Normal.sh
# @version 1.0
# @author qye.zheng
# @description shell 规范

#!/bin/sh


###################### shell 简介  ######################

# 1) shell 类型 
#	A) Bourne Shell (/usr/bin/sh 或 /bin/sh)	
#	B) Bourne Again Shell (/bin/bash)	 
#	C) C Shell (/usr/bin/csh) 
# 	D) K Shell (/usr/bin/ksh)
# 	E) Shell for Root (/sbin/sh)
#   常用的是 Bourne Shell 和 Bourne Again Shell，两者不区分，/bin/sh 或 /bin/bash
#

#
#
#

#
#
#


######################  ######################


# shell 编程
# 1) 编程的第一行: #!/bin/sh  或者 #!/bin/bash (#! 告诉系统，使用指定路径的程序来解析此脚本文件的shell程序) 
# 2) #! 是声明解析程序程序；# 是注释，若一行仍未结束，在末尾加上"，这个符号标明下一行和该行合并为一行
# 3) 保存为 xx.sh 文件后，修改文件的属性为可执行: chmod +x xx.sh，然后就可以执行此shell脚本文件
# 4) 执行shell文件: ./xx.sh
#
#

#
#
#

#
#
#

######################  ######################
#
#
#

#
#
#

#
#
#

######################  ######################


######################  ######################

######################  ######################
#
#
#

#
#
#

#
#
#

######################  ######################

#
#
#

#
#
#

#
#
#
######################  ######################


######################  ######################

######################  ######################


######################  ######################


######################  ######################


######################  ######################









