# ----- 信息 -----
# @filename Command.sh
# @version 1.0
# @author qye.zheng
# @description 常用命令

#!/bin/sh


#常用命令
# 查看命令历史记录
history
# 查看最近几个
history 数字
# 指定要执行命令的编号
!历史命令编号

# 显示变量
#（Linux是大小写敏感：变量名称一定要大写，否则无法识别）
echo $SHELL
echo $PATH
# 显示当前登录的用户名
echo $USER

# 软件装卸
#rpm [软件包管理器-通用命令]
rpm -vh

# 进程
# 查看包含xx的进程
ps -ef | grep xx
# 查看不包含xx的进程
ps -ef | grep -v xx

# ===== begin 用户管理 =====
#切换用户
# 切换到新用户, 环境不变
su <username>
# 切换用户新用户, 改变环境
su - <user-name>

# 修改权限
chmod +[r|w|x] <filename>

# ===== end of 用户管理 =====

#文件操作
# ===== begin 文件管理 =====
# 文件复制
# 强制覆盖(无提示)
cp -rf

# 移动文件
# 覆盖询问
mv -i f1,f2,... dest_dir

# ===== end of 文件管理 =====

#网络操作

#任务调度



######################  ######################


######################  ######################


######################  ######################


######################  ######################

######################  ######################


######################  ######################


######################  ######################


######################  ######################

######################  ######################


######################  ######################


######################  ######################


######################  ######################


















